{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,23,35,1],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"conv2d_Conv2D2","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[9,9],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"conv2d_Conv2D3","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D1","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D2","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D3","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D3","trainable":true},"inbound_nodes":[[["conv2d_Conv2D3",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D1",0,0,{}],["max_pooling2d_MaxPooling2D2",0,0,{}],["max_pooling2d_MaxPooling2D3",0,0,{}]]]},{"name":"conv2d_Conv2D4","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"max_pooling2d_MaxPooling2D4","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D4","trainable":true},"inbound_nodes":[[["conv2d_Conv2D4",0,0,{}]]]},{"name":"modeEmbedding","class_name":"Embedding","config":{"input_dim":24,"output_dim":8,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"modeEmbedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"flatten_Flatten2","class_name":"Flatten","config":{"name":"flatten_Flatten2","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D4",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["modeEmbedding",0,0,{}]]]},{"name":"concatenate_Concatenate2","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate2","trainable":true},"inbound_nodes":[[["flatten_Flatten2",0,0,{}],["flatten_Flatten1",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["concatenate_Concatenate2",0,0,{}]]]},{"name":"input18","class_name":"InputLayer","config":{"batch_input_shape":[null,7],"dtype":"float32","sparse":false,"name":"input18"},"inbound_nodes":[]},{"name":"input9","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input9"},"inbound_nodes":[]},{"name":"input10","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input10"},"inbound_nodes":[]},{"name":"input11","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input11"},"inbound_nodes":[]},{"name":"input12","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input12"},"inbound_nodes":[]},{"name":"input13","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input13"},"inbound_nodes":[]},{"name":"input14","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input14"},"inbound_nodes":[]},{"name":"input15","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input15"},"inbound_nodes":[]},{"name":"input16","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input16"},"inbound_nodes":[]},{"name":"input17","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input17"},"inbound_nodes":[]},{"name":"input19","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input19"},"inbound_nodes":[]},{"name":"input20","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input20"},"inbound_nodes":[]},{"name":"input21","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input21"},"inbound_nodes":[]},{"name":"input22","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input22"},"inbound_nodes":[]},{"name":"input23","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input23"},"inbound_nodes":[]},{"name":"input24","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input24"},"inbound_nodes":[]},{"name":"input25","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input25"},"inbound_nodes":[]},{"name":"input26","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input26"},"inbound_nodes":[]},{"name":"input27","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input27"},"inbound_nodes":[]},{"name":"input28","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input28"},"inbound_nodes":[]},{"name":"input29","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input29"},"inbound_nodes":[]},{"name":"input30","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input30"},"inbound_nodes":[]},{"name":"input31","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input31"},"inbound_nodes":[]},{"name":"input32","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input32"},"inbound_nodes":[]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"input4","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input4"},"inbound_nodes":[]},{"name":"input5","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input5"},"inbound_nodes":[]},{"name":"input6","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input6"},"inbound_nodes":[]},{"name":"input7","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input7"},"inbound_nodes":[]},{"name":"input8","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input8"},"inbound_nodes":[]},{"name":"batch_normalization_BatchNormalization10","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization10","trainable":true},"inbound_nodes":[[["input18",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization1","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true},"inbound_nodes":[[["input9",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization2","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true},"inbound_nodes":[[["input10",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization3","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true},"inbound_nodes":[[["input11",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization4","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization4","trainable":true},"inbound_nodes":[[["input12",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization5","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization5","trainable":true},"inbound_nodes":[[["input13",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization6","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization6","trainable":true},"inbound_nodes":[[["input14",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization7","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization7","trainable":true},"inbound_nodes":[[["input15",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization8","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization8","trainable":true},"inbound_nodes":[[["input16",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization9","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization9","trainable":true},"inbound_nodes":[[["input17",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization11","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization11","trainable":true},"inbound_nodes":[[["input19",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization12","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization12","trainable":true},"inbound_nodes":[[["input20",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization13","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization13","trainable":true},"inbound_nodes":[[["input21",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization14","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization14","trainable":true},"inbound_nodes":[[["input22",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization15","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization15","trainable":true},"inbound_nodes":[[["input23",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization16","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization16","trainable":true},"inbound_nodes":[[["input24",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization17","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization17","trainable":true},"inbound_nodes":[[["input25",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization18","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization18","trainable":true},"inbound_nodes":[[["input26",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization19","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization19","trainable":true},"inbound_nodes":[[["input27",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization20","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization20","trainable":true},"inbound_nodes":[[["input28",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization21","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization21","trainable":true},"inbound_nodes":[[["input29",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization22","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization22","trainable":true},"inbound_nodes":[[["input30",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization23","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization23","trainable":true},"inbound_nodes":[[["input31",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization24","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization24","trainable":true},"inbound_nodes":[[["input32",0,0,{}]]]},{"name":"input33","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input33"},"inbound_nodes":[]},{"name":"input34","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input34"},"inbound_nodes":[]},{"name":"input35","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input35"},"inbound_nodes":[]},{"name":"input36","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input36"},"inbound_nodes":[]},{"name":"input37","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input37"},"inbound_nodes":[]},{"name":"concatenate_Concatenate3","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate3","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}],["input3",0,0,{}],["input4",0,0,{}],["input5",0,0,{}],["input6",0,0,{}],["input7",0,0,{}],["input8",0,0,{}],["batch_normalization_BatchNormalization10",0,0,{}],["batch_normalization_BatchNormalization1",0,0,{}],["batch_normalization_BatchNormalization2",0,0,{}],["batch_normalization_BatchNormalization3",0,0,{}],["batch_normalization_BatchNormalization4",0,0,{}],["batch_normalization_BatchNormalization5",0,0,{}],["batch_normalization_BatchNormalization6",0,0,{}],["batch_normalization_BatchNormalization7",0,0,{}],["batch_normalization_BatchNormalization8",0,0,{}],["batch_normalization_BatchNormalization9",0,0,{}],["batch_normalization_BatchNormalization11",0,0,{}],["batch_normalization_BatchNormalization12",0,0,{}],["batch_normalization_BatchNormalization13",0,0,{}],["batch_normalization_BatchNormalization14",0,0,{}],["batch_normalization_BatchNormalization15",0,0,{}],["batch_normalization_BatchNormalization16",0,0,{}],["batch_normalization_BatchNormalization17",0,0,{}],["batch_normalization_BatchNormalization18",0,0,{}],["batch_normalization_BatchNormalization19",0,0,{}],["batch_normalization_BatchNormalization20",0,0,{}],["batch_normalization_BatchNormalization21",0,0,{}],["batch_normalization_BatchNormalization22",0,0,{}],["batch_normalization_BatchNormalization23",0,0,{}],["batch_normalization_BatchNormalization24",0,0,{}],["input33",0,0,{}],["input34",0,0,{}],["input35",0,0,{}],["input36",0,0,{}],["input37",0,0,{}]]]},{"name":"dense_Dense3","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true},"inbound_nodes":[[["concatenate_Concatenate3",0,0,{}]]]},{"name":"dense_Dense4","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true},"inbound_nodes":[[["dense_Dense3",0,0,{}]]]},{"name":"dense_Dense5","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true},"inbound_nodes":[[["dense_Dense4",0,0,{}]]]}],"input_layers":[["input1",0,0],["input2",0,0],["input3",0,0],["input4",0,0],["input5",0,0],["input6",0,0],["input7",0,0],["input8",0,0],["input9",0,0],["input10",0,0],["input11",0,0],["input12",0,0],["input13",0,0],["input14",0,0],["input15",0,0],["input16",0,0],["input17",0,0],["input18",0,0],["input19",0,0],["input20",0,0],["input21",0,0],["input22",0,0],["input23",0,0],["input24",0,0],["input25",0,0],["input26",0,0],["input27",0,0],["input28",0,0],["input29",0,0],["input30",0,0],["input31",0,0],["input32",0,0],["input33",0,0],["input34",0,0],["input35",0,0],["input36",0,0],["input37",0,0]],"output_layers":[["dense_Dense5",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightsManifest":[{"paths":["./BSP-04.02.weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[5,5,1,16],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[9,9,1,16],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[3,3,1,16],"dtype":"float32"},{"name":"conv2d_Conv2D3/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[3,3,48,32],"dtype":"float32"},{"name":"conv2d_Conv2D4/bias","shape":[32],"dtype":"float32"},{"name":"modeEmbedding/embeddings","shape":[24,8],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[1288,64],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/gamma","shape":[7],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/beta","shape":[7],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization12/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization12/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization17/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization17/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization18/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization18/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization19/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization19/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization20/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization20/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization21/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization21/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization22/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization22/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization23/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization23/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization24/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization24/beta","shape":[1],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[73,64],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[64,32],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/moving_mean","shape":[7],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization10/moving_variance","shape":[7],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization11/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization12/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization12/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization13/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization14/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization15/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization16/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization17/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization17/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization18/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization18/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization19/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization19/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization20/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization20/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization21/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization21/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization22/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization22/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization23/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization23/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization24/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization24/moving_variance","shape":[1],"dtype":"float32"}]}]}