{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input4","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input4"},"inbound_nodes":[]},{"name":"input5","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input5"},"inbound_nodes":[]},{"name":"mapEmbedding","class_name":"Embedding","config":{"input_dim":24,"output_dim":12,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"mapEmbedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["input4",0,0,{}]]]},{"name":"modeEmbedding","class_name":"Embedding","config":{"input_dim":6,"output_dim":8,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"modeEmbedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["input5",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["mapEmbedding",0,0,{}],["modeEmbedding",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"input15","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input15"},"inbound_nodes":[]},{"name":"input16","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input16"},"inbound_nodes":[]},{"name":"input17","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input17"},"inbound_nodes":[]},{"name":"input18","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input18"},"inbound_nodes":[]},{"name":"input19","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input19"},"inbound_nodes":[]},{"name":"input20","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input20"},"inbound_nodes":[]},{"name":"input21","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input21"},"inbound_nodes":[]},{"name":"input22","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input22"},"inbound_nodes":[]},{"name":"input23","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input23"},"inbound_nodes":[]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"input6","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input6"},"inbound_nodes":[]},{"name":"input7","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input7"},"inbound_nodes":[]},{"name":"input8","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input8"},"inbound_nodes":[]},{"name":"input9","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input9"},"inbound_nodes":[]},{"name":"input10","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input10"},"inbound_nodes":[]},{"name":"input11","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input11"},"inbound_nodes":[]},{"name":"batch_normalization_BatchNormalization1","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true},"inbound_nodes":[[["input15",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization2","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true},"inbound_nodes":[[["input16",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization3","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true},"inbound_nodes":[[["input17",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization4","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization4","trainable":true},"inbound_nodes":[[["input18",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization5","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization5","trainable":true},"inbound_nodes":[[["input19",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization6","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization6","trainable":true},"inbound_nodes":[[["input20",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization7","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization7","trainable":true},"inbound_nodes":[[["input21",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization8","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization8","trainable":true},"inbound_nodes":[[["input22",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization9","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization9","trainable":true},"inbound_nodes":[[["input23",0,0,{}]]]},{"name":"concatenate_Concatenate2","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate2","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}],["input6",0,0,{}],["input7",0,0,{}],["input8",0,0,{}],["input9",0,0,{}],["input10",0,0,{}],["input11",0,0,{}],["batch_normalization_BatchNormalization1",0,0,{}],["batch_normalization_BatchNormalization2",0,0,{}],["batch_normalization_BatchNormalization3",0,0,{}],["batch_normalization_BatchNormalization4",0,0,{}],["batch_normalization_BatchNormalization5",0,0,{}],["batch_normalization_BatchNormalization6",0,0,{}],["batch_normalization_BatchNormalization7",0,0,{}],["batch_normalization_BatchNormalization8",0,0,{}],["batch_normalization_BatchNormalization9",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["concatenate_Concatenate2",0,0,{}]]]},{"name":"dense_Dense3","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}]]]}],"input_layers":[["input4",0,0],["input5",0,0],["input6",0,0],["input7",0,0],["input8",0,0],["input9",0,0],["input10",0,0],["input11",0,0],["input15",0,0],["input16",0,0],["input17",0,0],["input18",0,0],["input19",0,0],["input20",0,0],["input21",0,0],["input22",0,0],["input23",0,0]],"output_layers":[["dense_Dense3",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"weightsManifest":[{"paths":["./my-model-2.weights.bin"],"weights":[{"name":"mapEmbedding/embeddings","shape":[24,12],"dtype":"float32"},{"name":"modeEmbedding/embeddings","shape":[6,8],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[20,16],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/beta","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/beta","shape":[1],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[31,32],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[32,1],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/moving_variance","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization9/moving_variance","shape":[1],"dtype":"float32"}]}]}